Sysbench_PolarDB_Mysql5.7-8.0/Sysbench-Mysql5.7-8.0_Guide/8Core32GB-1Node/sysbenchrun/202103192004/sysbench_read_write_1000.log
Time: 20210319200621, now running sysbench with thread of:  + 1000
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iwjknp9do507eiak.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=1000 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1000
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1000 tps: 3773.25 qps: 92927.34 (r/w/o: 65903.65/18511.84/8511.85) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1000 tps: 5079.42 qps: 94248.15 (r/w/o: 67093.71/16989.58/10164.86) lat (ms,95%): 458.96 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1000 tps: 3632.16 qps: 81125.66 (r/w/o: 55498.51/18354.83/7272.33) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1000 tps: 4005.19 qps: 79996.79 (r/w/o: 56049.66/15936.76/8010.38) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1000 tps: 4213.83 qps: 84274.68 (r/w/o: 58999.68/16847.34/8427.67) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1000 tps: 3964.10 qps: 78829.91 (r/w/o: 55225.34/15676.38/7928.19) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1000 tps: 3974.96 qps: 79672.13 (r/w/o: 55834.39/15887.83/7949.91) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1000 tps: 4083.86 qps: 80673.20 (r/w/o: 56344.04/16212.44/8116.72) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1000 tps: 4118.17 qps: 82869.46 (r/w/o: 58026.42/16555.69/8287.35) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1000 tps: 3993.92 qps: 79439.47 (r/w/o: 55555.93/15895.69/7987.85) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 1000 tps: 4322.99 qps: 86870.90 (r/w/o: 60905.93/17320.98/8643.99) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1000 tps: 3942.71 qps: 79258.21 (r/w/o: 55381.95/15990.83/7885.42) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 1000 tps: 4047.34 qps: 80869.73 (r/w/o: 56870.73/15902.32/8096.67) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 1000 tps: 4666.05 qps: 92697.02 (r/w/o: 64602.71/18762.21/9332.10) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1000 tps: 4076.07 qps: 82239.43 (r/w/o: 57758.01/16329.28/8152.14) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 1000 tps: 4375.73 qps: 87117.53 (r/w/o: 60836.18/17551.90/8729.45) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 1000 tps: 4015.84 qps: 80883.70 (r/w/o: 56709.68/16120.34/8053.67) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1000 tps: 4367.84 qps: 86957.90 (r/w/o: 60973.83/17249.39/8734.69) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 1000 tps: 4459.55 qps: 89498.00 (r/w/o: 62506.69/18071.22/8920.10) lat (ms,95%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1000 tps: 3675.82 qps: 73854.36 (r/w/o: 51672.45/14830.27/7351.64) lat (ms,95%): 511.33 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1000 tps: 3858.19 qps: 76444.70 (r/w/o: 53695.60/15032.73/7716.37) lat (ms,95%): 467.30 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 1000 tps: 3868.23 qps: 74181.28 (r/w/o: 51638.75/14808.06/7734.47) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 1000 tps: 3499.64 qps: 73636.43 (r/w/o: 51736.43/14898.72/7001.28) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1000 tps: 4144.74 qps: 83026.81 (r/w/o: 58117.37/16619.96/8289.48) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1000 tps: 4005.15 qps: 79792.05 (r/w/o: 55934.13/15847.60/8010.31) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 1000 tps: 3837.07 qps: 76996.42 (r/w/o: 53800.99/15521.29/7674.14) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1000 tps: 4839.09 qps: 96172.73 (r/w/o: 67164.21/19336.35/9672.17) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 1000 tps: 4084.02 qps: 81556.50 (r/w/o: 57132.35/16251.10/8173.05) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 1000 tps: 3892.96 qps: 78564.21 (r/w/o: 55141.45/15635.84/7786.92) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1000 tps: 3595.99 qps: 72052.76 (r/w/o: 50368.83/14491.95/7191.98) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 1000 tps: 3743.58 qps: 74981.64 (r/w/o: 52432.16/15062.32/7487.17) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 1000 tps: 4294.25 qps: 85299.04 (r/w/o: 59651.53/17062.01/8585.51) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 1000 tps: 3839.95 qps: 77336.92 (r/w/o: 54222.24/15431.78/7682.89) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 1000 tps: 3652.21 qps: 72725.11 (r/w/o: 50930.88/14491.82/7302.41) lat (ms,95%): 458.96 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1000 tps: 3689.47 qps: 71313.84 (r/w/o: 50031.87/13952.01/7329.96) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 1000 tps: 3902.42 qps: 80490.73 (r/w/o: 56385.11/16249.76/7855.85) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 1000 tps: 3842.17 qps: 76722.44 (r/w/o: 53765.41/15272.68/7684.34) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 1000 tps: 4266.82 qps: 84181.46 (r/w/o: 58550.54/17161.28/8469.64) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 1000 tps: 3882.26 qps: 79016.27 (r/w/o: 55386.70/15810.06/7819.52) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1000 tps: 4699.01 qps: 94234.29 (r/w/o: 65993.20/18835.06/9406.03) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 1000 tps: 4222.78 qps: 83998.71 (r/w/o: 58985.99/16567.15/8445.57) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 1000 tps: 4111.54 qps: 82604.79 (r/w/o: 57722.56/16658.14/8224.08) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 1000 tps: 4032.66 qps: 80766.19 (r/w/o: 56471.22/16229.65/8065.32) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 1000 tps: 4046.72 qps: 80383.51 (r/w/o: 56422.15/15867.92/8093.45) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1000 tps: 3738.82 qps: 73610.44 (r/w/o: 52333.47/13808.33/7468.64) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 1000 tps: 4066.49 qps: 82836.99 (r/w/o: 56993.87/17701.13/8141.98) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 1000 tps: 4014.64 qps: 80139.83 (r/w/o: 56083.98/16026.57/8029.28) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 1000 tps: 4110.16 qps: 81830.27 (r/w/o: 57752.31/15857.63/8220.33) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 1000 tps: 3781.92 qps: 75973.35 (r/w/o: 52873.85/15535.66/7563.84) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1000 tps: 4333.01 qps: 85094.16 (r/w/o: 59324.11/17115.03/8655.02) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 1000 tps: 3740.09 qps: 76425.82 (r/w/o: 53812.28/15122.36/7491.18) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 1000 tps: 3724.05 qps: 74146.90 (r/w/o: 51632.63/15066.18/7448.09) lat (ms,95%): 511.33 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 1000 tps: 4461.79 qps: 89288.75 (r/w/o: 62680.02/17688.16/8920.58) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 1000 tps: 4282.18 qps: 86199.53 (r/w/o: 60287.47/17344.71/8567.35) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1000 tps: 4006.58 qps: 79983.52 (r/w/o: 56072.05/15898.31/8013.15) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 1000 tps: 4290.32 qps: 81165.10 (r/w/o: 57860.35/14740.11/8564.64) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 1000 tps: 3135.21 qps: 67391.46 (r/w/o: 46003.04/15106.00/6282.42) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 1000 tps: 4108.31 qps: 81389.39 (r/w/o: 57047.46/16121.30/8220.62) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 1000 tps: 4274.61 qps: 85530.22 (r/w/o: 59741.53/17239.46/8549.22) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1000 tps: 4070.72 qps: 82244.32 (r/w/o: 57675.02/16427.87/8141.44) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 1000 tps: 4140.40 qps: 82791.96 (r/w/o: 57946.57/16564.59/8280.80) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 1000 tps: 3855.80 qps: 76610.03 (r/w/o: 53621.22/15277.21/7711.60) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 1000 tps: 3493.17 qps: 70417.53 (r/w/o: 49283.47/14147.71/6986.35) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 1000 tps: 3836.87 qps: 76243.35 (r/w/o: 53457.14/15112.48/7673.73) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 1000 tps: 4067.86 qps: 81689.26 (r/w/o: 57170.08/16383.45/8135.73) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 1000 tps: 3632.46 qps: 72170.23 (r/w/o: 50566.46/14338.86/7264.92) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 1000 tps: 4408.38 qps: 79610.87 (r/w/o: 55399.78/15455.33/8755.76) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 1000 tps: 2868.29 qps: 66277.63 (r/w/o: 46707.67/13772.38/5797.58) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 1000 tps: 3349.11 qps: 67343.21 (r/w/o: 46984.54/13660.45/6698.22) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 1000 tps: 4159.69 qps: 83099.76 (r/w/o: 58208.63/16571.76/8319.38) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 1000 tps: 3899.16 qps: 77322.21 (r/w/o: 54033.24/15493.64/7795.32) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 1000 tps: 4052.13 qps: 81653.63 (r/w/o: 57265.84/16280.52/8107.26) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 1000 tps: 3987.00 qps: 79876.03 (r/w/o: 55864.02/16038.01/7974.00) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 1000 tps: 3688.00 qps: 73752.96 (r/w/o: 51631.97/14744.99/7376.00) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 1000 tps: 3797.99 qps: 75419.90 (r/w/o: 52802.93/15035.98/7580.99) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 1000 tps: 3761.87 qps: 75315.32 (r/w/o: 52786.12/14990.47/7538.73) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 1000 tps: 3579.84 qps: 71758.78 (r/w/o: 50285.75/14313.36/7159.68) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 1000 tps: 3682.31 qps: 73969.14 (r/w/o: 51630.29/14974.24/7364.61) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 1000 tps: 4311.31 qps: 85633.27 (r/w/o: 60103.36/16907.29/8622.62) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 1000 tps: 4131.57 qps: 82816.50 (r/w/o: 57935.04/16618.31/8263.15) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 1000 tps: 4207.73 qps: 83414.64 (r/w/o: 58175.26/16843.92/8395.46) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 1000 tps: 3873.22 qps: 78400.53 (r/w/o: 55086.19/15547.90/7766.45) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 1000 tps: 3881.00 qps: 77245.06 (r/w/o: 54147.04/15336.01/7762.01) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 1000 tps: 4032.03 qps: 80148.58 (r/w/o: 55822.40/16265.12/8061.06) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 1000 tps: 3562.96 qps: 71465.11 (r/w/o: 50160.37/14175.82/7128.91) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 1000 tps: 3944.68 qps: 79441.47 (r/w/o: 55734.42/15817.70/7889.35) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 1000 tps: 4179.41 qps: 83591.13 (r/w/o: 58455.69/16776.63/8358.81) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 1000 tps: 3504.96 qps: 69934.13 (r/w/o: 49035.39/13888.83/7009.91) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 1000 tps: 3839.98 qps: 76152.53 (r/w/o: 53064.68/15410.91/7676.95) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 1000 tps: 3846.12 qps: 77981.48 (r/w/o: 54672.74/15613.50/7695.24) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 1000 tps: 4420.88 qps: 87688.68 (r/w/o: 61355.38/17494.54/8838.77) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 1000 tps: 4025.14 qps: 81249.74 (r/w/o: 56890.92/16305.55/8053.27) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 1000 tps: 3849.85 qps: 76966.00 (r/w/o: 53917.90/15348.40/7699.70) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 1000 tps: 4263.39 qps: 83319.09 (r/w/o: 58350.66/16442.65/8525.78) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 1000 tps: 3871.46 qps: 78215.30 (r/w/o: 54756.51/15724.87/7733.92) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 1000 tps: 4195.92 qps: 84710.42 (r/w/o: 59402.89/16905.68/8401.84) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 1000 tps: 3705.06 qps: 73908.23 (r/w/o: 51687.86/14810.25/7410.12) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 1000 tps: 3954.99 qps: 79286.81 (r/w/o: 55553.87/15823.96/7908.98) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 1000 tps: 3972.10 qps: 77144.94 (r/w/o: 55123.39/14087.35/7934.20) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 1000 tps: 4034.02 qps: 81194.34 (r/w/o: 56466.24/16664.07/8064.03) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 1000 tps: 3933.05 qps: 80543.97 (r/w/o: 55621.67/17041.20/7881.09) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 1000 tps: 4207.01 qps: 83830.29 (r/w/o: 58555.20/16861.06/8414.03) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 1000 tps: 4181.77 qps: 84211.41 (r/w/o: 58941.79/16906.08/8363.54) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 1000 tps: 3882.01 qps: 77606.24 (r/w/o: 54281.17/15561.05/7764.02) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 1000 tps: 4098.08 qps: 81138.59 (r/w/o: 56970.12/15977.31/8191.16) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 1000 tps: 4224.04 qps: 84932.77 (r/w/o: 59355.54/17126.16/8451.08) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 1000 tps: 4138.38 qps: 82323.59 (r/w/o: 57735.30/16309.54/8278.75) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 1000 tps: 3963.68 qps: 79980.79 (r/w/o: 55793.62/16259.80/7927.37) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 1000 tps: 3930.07 qps: 78800.38 (r/w/o: 55158.97/15781.28/7860.14) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 1000 tps: 4108.90 qps: 81829.06 (r/w/o: 57395.64/16215.62/8217.81) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 1000 tps: 4145.83 qps: 82607.52 (r/w/o: 57854.56/16464.31/8288.65) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 1000 tps: 3804.11 qps: 76462.24 (r/w/o: 53548.57/15302.45/7611.22) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 1000 tps: 3577.85 qps: 71811.04 (r/w/o: 50072.93/14582.40/7155.70) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 1000 tps: 3842.19 qps: 76691.70 (r/w/o: 53815.59/15192.73/7683.37) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 1000 tps: 4118.96 qps: 81160.30 (r/w/o: 56635.51/16287.86/8236.93) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 1000 tps: 4299.95 qps: 78601.04 (r/w/o: 56149.31/14010.83/8440.90) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 1000 tps: 2998.67 qps: 67909.51 (r/w/o: 46407.88/15391.30/6110.33) lat (ms,95%): 467.30 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 1000 tps: 3534.56 qps: 71204.25 (r/w/o: 50079.91/14007.21/7117.12) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 1000 tps: 4190.77 qps: 83786.43 (r/w/o: 58656.80/16748.09/8381.54) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 1000 tps: 4449.87 qps: 85069.46 (r/w/o: 59233.93/17165.91/8669.62) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6707848
        write:                           1916528
        other:                           958264
        total:                           9582640
    transactions:                        479132 (3983.73 per sec.)
    queries:                             9582640 (79674.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.2705s
    total number of events:              479132

Latency (ms):
         min:                                    7.98
         avg:                                  250.48
         max:                                 1188.27
         95th percentile:                      325.98
         sum:                            120013791.16

Threads fairness:
    events (avg/stddev):           479.1320/5.27
    execution time (avg/stddev):   120.0138/0.01